Revit 2024 API
WireType.NeutralRequired Property
 Whether or not the neutral point is required.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool NeutralRequired { get; set; }
Visual Basic
Public Property NeutralRequired As Boolean
	Get
	Set
Visual C++
public:
property bool NeutralRequired {
	bool get ();
	void set (bool value);
}
See Also
WireType Class
Autodesk.Revit.DB.Electrical Namespace